1) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:52    [M] LessThan

--- Original
+++ New
@@ @@
     public function dateNumberDays()
     {
         $currentAmount = $this->amountMoney;
-        for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
+        for ($numberDays = 0; $currentAmount <= $this->desiredAmount; $numberDays++) {
             $currentAmount += $currentAmount * $this->interestRate / 36000.0;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }


Timed Out mutants:
==================

1) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:53    [M] Assignment

--- Original
+++ New
@@ @@
     {
         $currentAmount = $this->amountMoney;
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += $currentAmount * $this->interestRate / 36000.0;
+            $currentAmount = $currentAmount * $this->interestRate / 36000.0;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }

2) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:53    [M] PlusEqual

--- Original
+++ New
@@ @@
     {
         $currentAmount = $this->amountMoney;
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += $currentAmount * $this->interestRate / 36000.0;
+            $currentAmount -= $currentAmount * $this->interestRate / 36000.0;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }
