1) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:30    [M] GreaterThan

--- Original
+++ New
@@ @@
         if ($amountMoney <= 0) {
             throw new \DomainException('Amount of money should be bigger than zero');
         }
-        if ($amountMoney > $desiredAmount) {
+        if ($amountMoney >= $desiredAmount) {
             throw new \DomainException('Desired amount should be bigger than amount of money');
         }
         if ($interestRate <= 0) {

3) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:53    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $currentAmount = $this->amountMoney;
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += $currentAmount * $this->interestRate / 36000;
+            $currentAmount += $currentAmount * $this->interestRate / 35999;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }

4) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:53    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $currentAmount = $this->amountMoney;
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += $currentAmount * $this->interestRate / 36000;
+            $currentAmount += $currentAmount * $this->interestRate / 36001;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }


Timed Out mutants:
==================

1) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:53    [M] Assignment

--- Original
+++ New
@@ @@
     {
         $currentAmount = $this->amountMoney;
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += $currentAmount * $this->interestRate / 36000;
+            $currentAmount = $currentAmount * $this->interestRate / 36000;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }

2) D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:53    [M] PlusEqual

--- Original
+++ New
@@ @@
     {
         $currentAmount = $this->amountMoney;
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += $currentAmount * $this->interestRate / 36000;
+            $currentAmount -= $currentAmount * $this->interestRate / 36000;
         }
         return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
     }
 }
