[Killed] Throw_
:31:13
         }
 
         if ($amountMoney > $desiredAmount) {
-            throw new \DomainException('Desired amount should be bigger or equal than amount of money');
+            new \DomainException('Desired amount should be bigger or equal than amount of money');
         }
 
killedBy: TargetDateTest::test_desired_amount_should_be_equals_or_bigger_than_amount_money
statusReason: 1) TargetDateTest::test_desired_amount_should_be_equals_or_bigger_than_amount_money
Failed asserting that exception of type "DomainException" is thrown.

phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] LessThanNegotiation
:53:9
         $currentAmount = $this->amountMoney;
 
 
-        for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
+        for ($numberDays = 0; $currentAmount >= $this->desiredAmount; $numberDays++) {
             $currentAmount += ($currentAmount * $this->interestRate) / 36000.0;
         }
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'2016-01-01'

[Killed] Multiplication
:54:13
 
 
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += ($currentAmount * $this->interestRate) / 36000.0;
+            $currentAmount += $currentAmount / $this->interestRate / 36000.0;
         }
 
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'2016-12-18'

[Killed] Division
:54:13
 
 
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += ($currentAmount * $this->interestRate) / 36000.0;
+            $currentAmount += $currentAmount * $this->interestRate * 36000.0;
         }
 
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'2016-01-02'
