[Killed] LessThanOrEqualToNegotiation
:26:9
         $this->desiredAmount = $desiredAmount;
         $this->interestRate = $interestRate;
 
-        if ($amountMoney <= 0) {
+        if ($amountMoney > 0) {
             throw new \DomainException('Amount of money should be bigger than zero');
         }
killedBy: TargetDateTest::test_deposit_date_should_be_on_January_first_2016
statusReason: 1) TargetDateTest::test_deposit_date_should_be_on_January_first_2016
DomainException: Amount of money should be bigger than zero

D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:24
D:\45384\Desktop\Projetos\target-date\tests\TargetDateTest.php:10
phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

ERRORS!

[Killed] LessThanOrEqualTo
:26:9
         $this->desiredAmount = $desiredAmount;
         $this->interestRate = $interestRate;
 
-        if ($amountMoney <= 0) {
+        if ($amountMoney < 0) {
             throw new \DomainException('Amount of money should be bigger than zero');
         }
killedBy: TargetDateTest::test_amount_of_money_should_be_bigger_than_zero
statusReason: 1) TargetDateTest::test_amount_of_money_should_be_bigger_than_zero
Failed asserting that exception of type "DomainException" is thrown.

phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Throw_
:27:13
         $this->interestRate = $interestRate;
 
         if ($amountMoney <= 0) {
-            throw new \DomainException('Amount of money should be bigger than zero');
+            new \DomainException('Amount of money should be bigger than zero');
         }
 
killedBy: TargetDateTest::test_amount_of_money_should_be_bigger_than_zero
statusReason: 1) TargetDateTest::test_amount_of_money_should_be_bigger_than_zero
Failed asserting that exception of type "DomainException" is thrown.

phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] GreaterThanNegotiation
:30:9
             throw new \DomainException('Amount of money should be bigger than zero');
         }
 
-        if ($amountMoney > $desiredAmount) {
+        if ($amountMoney <= $desiredAmount) {
             throw new \DomainException('Desired amount should be bigger than amount of money');
         }
killedBy: TargetDateTest::test_deposit_date_should_be_on_January_first_2016
statusReason: 1) TargetDateTest::test_deposit_date_should_be_on_January_first_2016
DomainException: Desired amount should be bigger than amount of money

D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:27
D:\45384\Desktop\Projetos\target-date\tests\TargetDateTest.php:10
phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

ERRORS!

[Survived] GreaterThan
:30:9
             throw new \DomainException('Amount of money should be bigger than zero');
         }
 
-        if ($amountMoney > $desiredAmount) {
+        if ($amountMoney >= $desiredAmount) {
             throw new \DomainException('Desired amount should be bigger than amount of money');
         }

[Killed] Throw_
:31:13
         }
 
         if ($amountMoney > $desiredAmount) {
-            throw new \DomainException('Desired amount should be bigger than amount of money');
+            new \DomainException('Desired amount should be bigger than amount of money');
         }
 
killedBy: TargetDateTest::test_desired_amount_should_be_bigger_than_amount_of_money
statusReason: 1) TargetDateTest::test_desired_amount_should_be_bigger_than_amount_of_money
Failed asserting that exception of type "DomainException" is thrown.

phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] LessThanOrEqualToNegotiation
:34:9
             throw new \DomainException('Desired amount should be bigger than amount of money');
         }
 
-        if ($interestRate <= 0) {
+        if ($interestRate > 0) {
             throw new \DomainException('Interest rate should be bigger than zero');
         }
killedBy: TargetDateTest::test_deposit_date_should_be_on_January_first_2016
statusReason: 1) TargetDateTest::test_deposit_date_should_be_on_January_first_2016
DomainException: Interest rate should be bigger than zero

D:\45384\Desktop\Projetos\target-date\src\TargetDate.php:30
D:\45384\Desktop\Projetos\target-date\tests\TargetDateTest.php:10
phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

ERRORS!

[Killed] LessThanOrEqualTo
:34:9
             throw new \DomainException('Desired amount should be bigger than amount of money');
         }
 
-        if ($interestRate <= 0) {
+        if ($interestRate < 0) {
             throw new \DomainException('Interest rate should be bigger than zero');
         }
killedBy: TargetDateTest::test_interest_rate_should_be_bigger_than_zero
statusReason: 1) TargetDateTest::test_interest_rate_should_be_bigger_than_zero
Failed asserting that exception of type "DomainException" is thrown.

phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] Throw_
:35:13
         }
 
         if ($interestRate <= 0) {
-            throw new \DomainException('Interest rate should be bigger than zero');
+            new \DomainException('Interest rate should be bigger than zero');
         }
 
killedBy: TargetDateTest::test_interest_rate_should_be_bigger_than_zero
statusReason: 1) TargetDateTest::test_interest_rate_should_be_bigger_than_zero
Failed asserting that exception of type "DomainException" is thrown.

phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
:43:5
     /**
      * @return DateTimeImmutable
      */
-    public static function getDepositDate()
+    protected static function getDepositDate()
     {
         return self::$depositDate;
killedBy: TargetDateTest::test_deposit_date_should_be_on_January_first_2016
statusReason: 1) TargetDateTest::test_deposit_date_should_be_on_January_first_2016
Error: Call to protected method Bank\TargetDate::getDepositDate() from context 'TargetDateTest'

D:\45384\Desktop\Projetos\target-date\tests\TargetDateTest.php:13
phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
:48:5
         return self::$depositDate;
     }
 
-    public function dateNumberDays()
+    protected function dateNumberDays()
     {
         $currentAmount = $this->amountMoney;
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Error: Call to protected method Bank\TargetDate::dateNumberDays() from context 'TargetDateTest'

D:\45384\Desktop\Projetos\target-date\tests\TargetDateTest.php:49
phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

ERRORS!
Tests: 5, Assertions: 7, Errors: 1.

[Killed] Increment
:52:9
     {
         $currentAmount = $this->amountMoney;
 
-        for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
+        for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays--) {
             $currentAmount += ($currentAmount * $this->interestRate) / 36000;
         }
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'1970-01-01'

[Killed] DecrementInteger
:52:9
     {
         $currentAmount = $this->amountMoney;
 
-        for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
+        for ($numberDays = -1; $currentAmount < $this->desiredAmount; $numberDays++) {
             $currentAmount += ($currentAmount * $this->interestRate) / 36000;
         }
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'2016-12-31'

[Killed] Multiplication
:53:13
         $currentAmount = $this->amountMoney;
 
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += ($currentAmount * $this->interestRate) / 36000;
+            $currentAmount += $currentAmount / $this->interestRate / 36000;
         }
 
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'2016-12-18'

[Killed] Division
:53:13
         $currentAmount = $this->amountMoney;
 
         for ($numberDays = 0; $currentAmount < $this->desiredAmount; $numberDays++) {
-            $currentAmount += ($currentAmount * $this->interestRate) / 36000;
+            $currentAmount += $currentAmount * $this->interestRate * 36000;
         }
 
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2017-01-01'
+'2016-01-02'

[Killed] FunctionCall
:56:9
             $currentAmount += ($currentAmount * $this->interestRate) / 36000;
         }
 
-        return date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
+        date('Y-m-d', strtotime("2016-01-01 + {$numberDays} days"));
+        return null;
     }
 
killedBy: TargetDateTest::test_basics
statusReason: 1) TargetDateTest::test_basics
Failed asserting that null is identical to '2017-01-01'.

D:\45384\Desktop\Projetos\target-date\tests\TargetDateTest.php:49
phpvfscomposer://D:\45384\Desktop\Projetos\target-date\vendor\phpunit\phpunit\phpunit:97

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.
